#include <iostream>
#include <string>
#include <vector>
#include <algorithm>
#include <cctype>
#include <random>
#include <map>

using namespace std;

//Реализовать класс Menu
//system("cls") - для обновления текста в консоли
// Узнать имя пользователя, который будет играть

//Надо сделать обновялемый текст в консоли
//Сделать Блэкджэк и рулетку

//Написать то, какие ставки можно делать, иксы за их выпадение и анимацию прокрута колеса
//Сначала реализовать стаку на отдельные номера, а потом на все остальное
//Подсоединить Roulette к Menu
